Show / Hide Table of Contents
Class ProjectDataConcrete
Project data concrete
Inheritance
System.Object
OpenObject
ProjectDataConcrete
ProjectDataConcreteEc2
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class ProjectDataConcrete : OpenObject
Constructors
Improve this Doc   View Source
ProjectDataConcrete()
Constructor
Declaration
public ProjectDataConcrete()
Properties
Improve this Doc   View Source
DesignWorkingLife
Design working fife
Declaration
public int DesignWorkingLife { get; set; }
Property Value
 Type |  Description
 System.Int32
 Improve this Doc
 View Source